<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release of DisplayLink package, extracts version number and imports the package into Jamf Pro server.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.DisplayLink</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Drivers</string>
    <key>PROD_NAME</key>
		<string>DisplayLink Drivers</string>
		<key>GROUP_NAME</key>
		<string>%NAME%-update-smart</string>
		<key>GROUP_TEMPLATE</key>
		<string>SmartGroupTemplate.xml</string>
		<key>NAME</key>
		<string>DisplayLink</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.15.x,10.14.x</string>
    <key>PACKAGE_REBOOT</key>
    <string>True</string>
		<key>POLICY_CATEGORY</key>
		<string>Testing</string>
		<key>POLICY_TEMPLATE</key>
		<string>PolicyTemplateWithTrigger.xml</string>
    <key>POLICY_TRIGGER</key>
    <string>install-displaylink</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Install driver for DisplayLink® enabled USB graphics device that is incorporated in your dock, adapter or monitor. This software provides support for the DisplayLink enabled video outputs.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>DisplayLink.png</string>
    <key>EXTENSION_ATTRIBUTE</key>
    <string>DisplayLinkExtensionAttribute.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.marcelpogorzelski.pkg.DisplayLink</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>groups</key>
				<array>
					<dict>
						<key>name</key>
						<string>%GROUP_NAME%</string>
						<key>smart</key>
						<true/>
						<key>template_path</key>
						<string>%GROUP_TEMPLATE%</string>
					</dict>
				</array>
        <key>extension_attributes</key>
        <array>
            <dict>
                <key>ext_attribute_path</key>
                <string>%EXTENSION_ATTRIBUTE%</string>
            </dict>
        </array>
				<key>os_requirements</key>
				<string>%OS_REQUIREMENTS%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
