<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads EndNote X9 disk image and builds a package, then uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.pkg.EndNoteX9</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
        <key>PROD_NAME</key>
		<string>EndNote X9</string>
		<key>NAME</key>
		<string>EndNoteX9</string>
		<key>POLICY_CATEGORY</key>
		<string>Productivity</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-endnotex9</string>
		<key>POLICY_TEMPLATE</key>
		<string>ScopedTriggerPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>EndNote is the industry standard software tool for publishing and managing bibliographies, citations and references on the Windows and Macintosh desktop.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>EndNoteX9.png</string>
        <key>SCRIPT_NAME</key>
		<string>EndnoteX9License.sh</string>
        <key>SCRIPT_TEMPLATE</key>
		<string>EndnoteX9ScriptTemplate.xml</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.EndNoteX9</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pkg_path%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
                <key>scripts</key>
                <array>
                    <dict>
                        <key>name</key>
                        <string>%SCRIPT_NAME%</string>
                        <key>template_path</key>
                        <string>%SCRIPT_TEMPLATE%</string>
                    </dict>
                </array>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
