<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest Firefox and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.marcelpogorzelski.jss.Firefox</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>Firefox</string>
            <key>CATEGORY</key>
            <string>Web Browsers and Internet Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Web Browsers and Internet Utilities</string>
            <key>CUSTOM_TRIGGER</key>
        		<string>install-firefox</string>
            <key>POLICY_TEMPLATE</key>
            <string>TriggerPolicyTemplate.xml</string>
            <key>ICON</key>
            <string>Firefox.png</string>
            <key>DESCRIPTION</key>
            <string>Web Browser.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.Firefox</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                    <key>groups</key>
                    <array>
                        <dict>
                            <key>name</key>
                            <string>UiT-Ansattemaskiner</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>UitGroupTemplate.xml</string>
                        </dict>
                        <dict>
                            <key>name</key>
                            <string>UiT-Datalabmaskiner</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>UitGroupTemplate.xml</string>
                        </dict>
                        <dict>
                            <key>name</key>
                            <string>UiT-Munkimaskiner</string>
                            <key>smart</key>
                            <true/>
                            <key>template_path</key>
                            <string>UitGroupTemplate.xml</string>
                        </dict>
                    </array>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
