<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest GoogleChrome and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.marcelpogorzelski.jss.googlechrome</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>GoogleChrome</string>
            <key>PNAME</key>
            <string>Google Chrome</string>
            <key>JSS_INVENTORY_NAME</key>
            <string>Google Chrome.app</string>
            <key>CATEGORY</key>
            <string>Web Browsers and Internet Utilities</string>
            <key>POLICY_CATEGORY</key>
            <string>Web Browsers and Internet Utilities</string>
            <key>CUSTOM_TRIGGER</key>
        		<string>install-chrome</string>
            <key>POLICY_TEMPLATE</key>
            <string>ScopedTriggerPolicyTemplate.xml</string>
            <key>ICON</key>
            <string>GoogleChrome.png</string>
            <key>DESCRIPTION</key>
            <string>Google Chrome is a browser that combines a minimal design with sophisticated technology to make the web faster, safer, and easier.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.rtrouton.pkg.googlechromeuniversal</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>prod_name</key>
                    <string>%PNAME%</string>
                    <key>jss_inventory_name</key>
                    <string>%JSS_INVENTORY_NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
