<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of the Microsoft OneDrive Standalone installer and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.MicrosoftOneDrive</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
    <key>PROD_NAME</key>
		<string>OneDrive</string>
		<key>NAME</key>
		<string>OneDrive</string>
		<key>POLICY_CATEGORY</key>
		<string>Microsoft</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-onedrive</string>
		<key>POLICY_TEMPLATE</key>
		<string>ScopedTriggerPolicyNoSelfServiceTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Get to your files from anywhere, on any device, with Microsoft OneDrive. Share and work together with anyone in your work and life. With OneDrive for Business, you also get storage for your work files so you can share and collaborate on them with other people at your work or school/university. The OneDrive app for Mac makes it easy to work with your OneDrive files on your Mac.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>OneDrive.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.marcelpogorzelski.pkg.microsoftonedrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
