<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current standalone Microsoft OneDrive installer, extracts version information and renames the installer package.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.pkg.microsoftonedrive</string>
      <key>Input</key>
      <dict>
         <key>NAME</key>
         <string>MicrosoftOneDrive</string>
         <key>VENDOR</key>
         <string>Microsoft</string>
         <key>SOFTWARETITLE</key>
         <string>OneDrive</string>
      </dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.download.microsoftonedrive</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>FlatPkgUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>flat_pkg_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgPayloadUnpacker</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_payload_path</key>
                <string>%RECIPE_CACHE_DIR%/unpack/%SOFTWARETITLE%.pkg/Payload</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/payload/%SOFTWARETITLE%.app/Contents/Info.plist</string>
                <key>plist_version_key</key>
                <string>CFBundleShortVersionString</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCopier</string>
            <key>Arguments</key>
            <dict>
                <key>source_pkg</key>
                <string>%pathname%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
        <dict>
        <key>Arguments</key>
        <dict>
            <key>path_list</key>
            <array>
                <string>%RECIPE_CACHE_DIR%/unpack</string>
                <string>%RECIPE_CACHE_DIR%/payload</string>
            </array>
        </dict>
        <key>Processor</key>
        <string>PathDeleter</string>
	</dict>
	</array>
</dict>
</plist>
