<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest unlicensed Microsoft Outlook for Office 2019 installer package and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.MicrosoftOutlook2019</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
    <key>PROD_NAME</key>
		<string>Microsoft Outlook</string>
		<key>NAME</key>
		<string>MicrosoftOutlook</string>
		<key>OS_REQUIREMENTS</key>
		<string>10.15.x,10.14.x,10.13.x,10.12.x</string>
		<key>POLICY_CATEGORY</key>
		<string>Microsoft</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-outlook</string>
		<key>POLICY_TEMPLATE</key>
		<string>ScopedTriggerPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Outlook is a comprehensive personal information manager. Although often used as an email app, it also includes a calendar, task manager, contact manager, and many other features.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftOutlook365.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSOutlook2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
