<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Excel 2019 multilingual update pkg,
		and appends the version to the end of the filename.
		Then, uploads to the JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.MicrosoftExcel2019</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
    <key>PROD_NAME</key>
		<string>Microsoft Excel</string>
		<key>NAME</key>
		<string>MicrosoftExcel</string>
		<key>POLICY_CATEGORY</key>
		<string>Microsoft</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-excel</string>
		<key>POLICY_TEMPLATE</key>
		<string>ScopedTriggerPolicyNoSelfServiceTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft Excel is a spreadsheet application featuring calculation, graphing tools, PivotTables, and a macro programming language called Visual Basic for Applications.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftExcel365.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSExcel2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
