<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Uses parent download recipe to download the latest unlicensed Microsoft OneNote for Office 2019 installer package and import it into the JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.MicrosoftOneNote2019</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Microsoft</string>
    <key>PROD_NAME</key>
		<string>Microsoft OneNote</string>
		<key>NAME</key>
		<string>MicrosoftOneNote</string>
		<key>POLICY_CATEGORY</key>
		<string>Microsoft</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-onenote</string>
		<key>POLICY_TEMPLATE</key>
		<string>ScopedTriggerPolicyNoSelfServiceTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Microsoft OneNote allows free-form information gathering and multi-user collaboration. It gathers users' notes (handwritten or typed), drawings, screen clippings and audio commentaries.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftOneNote365.png</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.MSOneNote2019</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
