<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads MindManger disk image, and builds a package and imports it into your JSS.</string>
	<key>Identifier</key>
	<string>com.github.marcelpogorzelski.jss.MindManger</string>
	<key>Input</key>
	<dict>
		<key>CATEGORY</key>
		<string>Productivity</string>
    <key>PROD_NAME</key>
		<string>Mindjet MindManager</string>
		<key>NAME</key>
		<string>MindManager</string>
		<key>POLICY_CATEGORY</key>
		<string>Productivity</string>
		<key>CUSTOM_TRIGGER</key>
		<string>install-mindmanager</string>
		<key>POLICY_TEMPLATE</key>
		<string>TriggerPolicyTemplate.xml</string>
		<key>SELF_SERVICE_DESCRIPTION</key>
		<string>Digital mind mapping and data visualization.</string>
		<key>SELF_SERVICE_ICON</key>
		<string>MicrosoftTeams.png</string>
    <key>SCRIPT_NAME</key>
		<string></string>
    <key>SCRIPT_TEMPLATE</key>
		<string></string>
    <key>SCRIPT_CATEGORY</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.2</string>
	<key>ParentRecipe</key>
	<string>com.github.marcelpogorzelski.pkg.MindManger</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>category</key>
				<string>%CATEGORY%</string>
				<key>policy_category</key>
				<string>%POLICY_CATEGORY%</string>
				<key>policy_template</key>
				<string>%POLICY_TEMPLATE%</string>
				<key>prod_name</key>
				<string>%PROD_NAME%</string>
        <key>scripts</key>
				<array>
					<dict>
						<key>name</key>
						<string>%SCRIPT_NAME%</string>
						<key>template_path</key>
						<string>%SCRIPT_TEMPLATE%</string>
					</dict>
				</array>
				<key>self_service_description</key>
				<string>%SELF_SERVICE_DESCRIPTION%</string>
				<key>self_service_icon</key>
				<string>%SELF_SERVICE_ICON%</string>
			</dict>
			<key>Processor</key>
			<string>JSSImporter</string>
		</dict>
	</array>
</dict>
</plist>
