<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Uses parent pkg recipe to download latest RStudio and import it into the JSS.</string>
        <key>Identifier</key>
        <string>com.github.marcelpogorzelski.jss.RStudio</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>RStudio</string>
            <key>CATEGORY</key>
            <string>Development</string>
            <key>POLICY_CATEGORY</key>
            <string>Development</string>
            <key>CUSTOM_TRIGGER</key>
        	<string>install-rstudio</string>
            <key>POLICY_TEMPLATE</key>
            <string>ScopedTriggerPolicyTemplate.xml</string>
            <key>ICON</key>
            <string>RStudio.png</string>
            <key>DESCRIPTION</key>
            <string>RStudio IDE is a powerful and productive user interface for R.</string>
        </dict>
        <key>MinimumVersion</key>
        <string>0.4.0</string>
        <key>ParentRecipe</key>
        <string>com.github.marcelpogorzelski.pkg.RStudio</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>version</key>
                    <string>%version%</string>
                    <key>prod_name</key>
                    <string>%NAME%</string>
                    <key>category</key>
                    <string>%CATEGORY%</string>
                    <key>policy_category</key>
                    <string>%POLICY_CATEGORY%</string>
                    <key>policy_template</key>
                    <string>%POLICY_TEMPLATE%</string>
                    <key>self_service_icon</key>
                    <string>%ICON%</string>
                    <key>self_service_description</key>
                    <string>%DESCRIPTION%</string>
                </dict>
                <key>Processor</key>
                <string>JSSImporter</string>
            </dict>
        </array>
    </dict>
</plist>
