<?xml version="1.0" encoding="UTF-8"?>
<policy>
  <general>
    <name>%INSTALL_POLICY_NAME%</name>
    <enabled>true</enabled>
    <trigger_other>%INSTALL_TRIGGER%</trigger_other>
    <frequency>Ongoing</frequency>
    <category>
      <name>%INSTALL_POLICY_CATEGORY%</name>
    </category>
  </general>
  <scope>
    <computers/>
    <computer_groups>
      <computer_group>
        <name>macOS Drift test macs</name>
      </computer_group>
    </computer_groups>
  </scope>
  <self_service>
    <use_for_self_service>false</use_for_self_service>
  </self_service>
  <package_configuration>
    <packages>
      <size>0</size>
    </packages>
  </package_configuration>
  <scripts>
    <size>1</size>
    <script>
      <name>Installomator TEST</name>
      <priority>Before</priority>
      <parameter4>%INSTALLOMATOR_LABEL%</parameter4>
      <parameter5>NOTIFY=%INSTALLOMATOR_NOTIFY%</parameter5>
      <parameter6>BLOCKING_PROCESS_ACTION=%INSTALLOMATOR_BLOCK%</parameter6>
      <parameter7>REOPEN=%INSTALLOMATOR_REOPEN%</parameter7>
      <parameter8>DIALOG_CMD_FILE=%INSTALLOMATOR_DIALOG%</parameter8>
      <parameter9/>
      <parameter10/>
      <parameter11/>
    </script>
  </scripts>
</policy>
