<?xml version="1.0" encoding="UTF-8"?>
<policy>
    <general>
        <name>%SS_INSTALL_POLICY_NAME%</name>
        <enabled>true</enabled>
        <frequency>Ongoing</frequency>
        <category>
            <name>%SS_INSTALL_POLICY_CATEGORY%</name>
        </category>
    </general>
    <scope>
        <computers/>
        <computer_groups>
            <computer_group>
                <name>%PROVISIONED_GROUP_NAME%</name>
            </computer_group>
        </computer_groups>
    </scope>
    <self_service>
        <use_for_self_service>true</use_for_self_service>
        <self_service_display_name>%NAME%</self_service_display_name>
        <install_button_text>Install</install_button_text>
        <reinstall_button_text>Install</reinstall_button_text>
        <self_service_description>%DESCRIPTION%</self_service_description>
        <self_service_icon>
            <id>%ICON_ID%</id>
            <uri>%ICON_URI%</uri>
        </self_service_icon>
    </self_service>
    <package_configuration>
        <packages>
            <size>0</size>
        </packages>
    </package_configuration>
    <scripts>
        <size>4</size>
        <script>
            <name>00_Prepare_SwiftDialog.sh</name>
            <priority>Before</priority>
            <parameter4>%INSTALLOMATOR_DIALOG%</parameter4>
            <parameter5>Installing %NAME%...</parameter5>
            <parameter6>%ICON_URI%</parameter6>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
        <script>
            <name>Dock Add App to end SwiftTest</name>
            <priority>After</priority>
            <parameter4>%NAME%</parameter4>
            <parameter5>%INSTALLOMATOR_DIALOG%</parameter5>
            <parameter6/>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
        <script>
            <name>Policy run with Trigger</name>
            <priority>Before</priority>
            <parameter4>%INSTALL_TRIGGER%</parameter4>
            <parameter5>false</parameter5>
            <parameter6/>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
        <script>
            <name>zz_Quit_SwiftDialog.sh</name>
            <priority>After</priority>
            <parameter4>%INSTALLOMATOR_DIALOG%</parameter4>
            <parameter5/>
            <parameter6/>
            <parameter7/>
            <parameter8/>
            <parameter9/>
            <parameter10/>
            <parameter11/>
        </script>
    </scripts>
    <maintenance>
        <recon>true</recon>
    </maintenance>
</policy>
