Identifier: no.uit.jamf.policies_installomator
ParentRecipe: no.uit.jamf.groups_installomator
MinimumVersion: "2.3"

Input:
  NAME: "HandBrake"
  ICON_URI: "https://ics.services.jamfcloud.com/icon/hash_48f26aa4e2263e1abc6d27a6b1ae20fc84c6e61d34fceb48ff856dbca73a7312"
  ICON_ID: "4528"
  INSTALL_POLICY_NAME: "%NAME% Install"
  INSTALL_POLICY_CATEGORY: "Testing"
  INSTALLOMATOR_SCRIPT: "Installomator"
  INSTALLOMATOR_LABEL: "handbrake"
  INSTALLOMATOR_NOTIFY: "silent"
  INSTALLOMATOR_BLOCK: "tell_user"
  INSTALLOMATOR_REOPEN: "yes"
  INSTALLOMATOR_DIALOG: "/var/tmp/uit_self_service_dialog.log"
  INSTALL_POLICY_TEMPLATE: "install_policy_template.xml"
  INSTALL_TRIGGER: "install-handbrake"
  SS_INSTALL_POLICY_NAME: "%NAME% Install - Self Service"
  SS_INSTALL_POLICY_CATEGORY: "Testing"
  DESCRIPTION: "**HandBrake** is a open-source tool, built by volunteers, for converting video from nearly any format to a selection of modern, widely supported codecs."
  SS_INSTALL_POLICY_TEMPLATE: "ss_install_policy_template.xml"
  SS_UNINSTALL_POLICY_NAME: "%NAME% Uninstall - Self Service"
  SS_UNINSTALL_POLICY_CATEGORY: "Testing"
  UNINSTALL_DESCRIPTION: "Removes **%NAME%**"
  SS_UNINSTALL_POLICY_TEMPLATE: "ss_uninstall_policy_template.xml"
  UNINSTALL_TRIGGER: "uninstall-handbrake"
  REMOVE_SCRIPT: "Remove Application"
  REMOVE_APPLICATION_NAME: "%NAME%"
  REMOVE_APPLICATION_RECEIPT: "<parameter5/>"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%INSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SS_INSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SS_UNINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%INSTALL_POLICY_TEMPLATE%"
      policy_name: "%INSTALL_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SS_INSTALL_POLICY_TEMPLATE%"
      policy_name: "%SS_INSTALL_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SS_UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%SS_UNINSTALL_POLICY_NAME%"
