Identifier: no.uit.jamf.policies_installomator
ParentRecipe: no.uit.jamf.groups_installomator
MinimumVersion: "2.3"

Input:
  NAME: "SETNAME"
  ICON_URI: "SETURI"
  ICON_ID: "SETID"
  INSTALL_POLICY_NAME: "%NAME% Install"
  INSTALL_POLICY_CATEGORY: "Installers"
  INSTALLOMATOR_SCRIPT: "Installomator"
  INSTALLOMATOR_LABEL: "SETLABEL"
  INSTALLOMATOR_NOTIFY: "silent"
  INSTALLOMATOR_BLOCK: "tell_user"
  INSTALLOMATOR_REOPEN: "yes"
  INSTALLOMATOR_DIALOG: "/var/tmp/uit_self_service_dialog.log"
  INSTALL_POLICY_TEMPLATE: "policy_i_template.xml"
  INSTALL_TRIGGER: "install-%INSTALLOMATOR_LABEL%"
  SS_INSTALL_POLICY_NAME: "%NAME% Install - Self Service"
  SS_INSTALL_POLICY_CATEGORY: "Applications"
  DESCRIPTION: ""
  SS_INSTALL_POLICY_TEMPLATE: "policy_ssid_template.xml"
  SS_UNINSTALL_POLICY_NAME: "%NAME% Uninstall - Self Service"
  SS_UNINSTALL_POLICY_CATEGORY: "Remove Applications"
  UNINSTALL_DESCRIPTION: "Removes **%NAME%**"
  SS_UNINSTALL_POLICY_TEMPLATE: "policy_ssun_template.xml"
  UNINSTALL_TRIGGER: "uninstall-%INSTALLOMATOR_LABEL%"
  REMOVE_SCRIPT: "Remove Application"
  REMOVE_APPLICATION_NAME: "%NAME%"
  REMOVE_APPLICATION_RECEIPT: "<parameter5/>"
  SS_UPDATE_POLICY_NAME: "%NAME% Update - Self Service"
  SS_UPDATE_POLICY_CATEGORY: "Updates"
  SS_UPDATE_POLICY_TEMPLATE: "policy_ssup_template.xml"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%INSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SS_INSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SS_UNINSTALL_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfCategoryUploader
    Arguments:
      category_name: "%SS_UPDATE_POLICY_CATEGORY%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%INSTALL_POLICY_TEMPLATE%"
      policy_name: "%INSTALL_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SS_INSTALL_POLICY_TEMPLATE%"
      policy_name: "%SS_INSTALL_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SS_UNINSTALL_POLICY_TEMPLATE%"
      policy_name: "%SS_UNINSTALL_POLICY_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%SS_UPDATE_POLICY_TEMPLATE%"
      policy_name: "%SS_UPDATE_POLICY_NAME%"
