Identifier: no.uit.jamf.upload_icon
MinimumVersion: "2.3"

Input:
  ICON_PATH: "icons/handbrake.png"

Process:
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfIconUploader
    Arguments:
      icon_file: "%ICON_PATH%"
